---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.Contains(Autodesk.Revit.DB.Element)
source: html/a4c116c9-296b-a9a0-828e-7808595c9c94.htm
---
# Autodesk.Revit.DB.ElementSet.Contains Method

Tests for the existence of an element within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	Element item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Element`) - The element to be searched for.

## Returns
The Contains method returns True if the element is within the set, otherwise False.